/*-----------------------------------------------
  名称：定时器库函数
  编写：夏杰
  日期：2017.4.10
  内容：定时器初始化、中断函数
------------------------------------------------*/
#include "sc.h"

// 定时器定时周期:100us 
// (12M:timer_time = 100; 11.0582M:timer_time = 92;)
#define timer_time 92

// 定时器计数器，累计定时中断次数
static uint timer_count = 0;

/*-----------------------------------------------
  TODO：定时器初始化
  参数：
  编写：夏杰
  日期：2017.4.10
------------------------------------------------*/
void timer_init()
{
	// 定时器初始化
	TMOD = 0x01;
	TH0 = (65535 - timer_time) / 256;	//定时500us,,即0.5ms
	TL0 = (65535 - timer_time) % 256;

	// 使能总中断
	EA = 1;

	// 使能内部中断0
	ET0 = 1;
	
	// 启动定时器0(start timer0)
	TR0 = 1;	
}

/*-----------------------------------------------
  TODO：定时器0中断函数
  参数：
  编写：夏杰
  日期：2017.4.10
------------------------------------------------*/
void timer0() interrupt 1 using 1
{	
	// pause timer0
	TR0 = 0;

	// 定时器重置
	TH0 = (65535 - timer_time) / 256;	//定时100us,,即0.1ms
	TL0 = (65535 - timer_time) % 256;

	// 高电平控制,,即打舵时间,,打舵角度大小
	timer_count++;	
	
	// PWM周期设定
	if(timer_count >= 200)
	{
		timer_count = 0;
	}
	
	// 高电平占空
	if(timer_count <= steer_duty)	//PWM周期
		steer_out = 1;
	else
		steer_out = 0;

	// start timer0
	TR0 = 1;
}

























